In [1]:
%load_ext sql
%sql postgresql://postgres:RKhM7ewvU7quDC@localhost:5432/dme_m03

In [2]:
%%sql
SELECT table_name FROM information_schema.tables WHERE table_schema='public';

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('eventplanline',),
 ('resourcetbl',),
 ('employee',),
 ('facility',),
 ('location',),
 ('customer',),
 ('eventrequest',),
 ('eventplan',)]

In [3]:
%%sql

SELECT * FROM Employee;

 * postgresql://postgres:***@localhost:5432/dme_m03
4 rows affected.

[('E100', 'Chuck Coordinator', 'Administration', 'chuck@colorado.edu', '3-1111'),
 ('E101', 'Mary Manager', 'Football', 'mary@colorado.edu', '5-1111'),
 ('E102', 'Sally Supervisor', 'Planning', 'sally@colorado.edu', '3-2222'),
 ('E103', 'Alan Administrator', 'Administration', 'alan@colorado.edu', '3-3333')]

In [5]:
%%sql

SELECT * FROM ResourceTbl;

 * postgresql://postgres:***@localhost:5432/dme_m03
6 rows affected.

[('R100', 'attendant', 10),
 ('R101', 'police', 15),
 ('R102', 'usher', 10),
 ('R103', 'nurse', 20),
 ('R104', 'janitor', 15),
 ('R105', 'food service', 10)]

In [6]:
%%sql

SELECT * FROM EventRequest;

 * postgresql://postgres:***@localhost:5432/dme_m03
8 rows affected.

[('E100', datetime.date(2018, 10, 25), datetime.date(2018, 6, 6), 'C100', 'F100', datetime.date(2018, 6, 8), 'Approved', 5000, 80000, 'B1000'),
 ('E101', datetime.date(2018, 10, 26), datetime.date(2018, 7, 28), 'C100', 'F100', None, 'Pending', 5000, 80000, 'B1000'),
 ('E103', datetime.date(2018, 9, 21), datetime.date(2018, 7, 28), 'C100', 'F100', datetime.date(2018, 8, 1), 'Approved', 5000, 80000, 'B1000'),
 ('E102', datetime.date(2018, 9, 14), datetime.date(2018, 7, 28), 'C100', 'F100', datetime.date(2018, 7, 31), 'Approved', 5000, 80000, 'B1000'),
 ('E104', datetime.date(2018, 12, 3), datetime.date(2018, 7, 28), 'C101', 'F101', datetime.date(2018, 7, 31), 'Approved', 2000, 12000, 'B1000'),
 ('E105', datetime.date(2018, 12, 5), datetime.date(2018, 7, 28), 'C101', 'F101', datetime.date(2018, 8, 1), 'Approved', 2000, 10000, 'B1000'),
 ('E106', datetime.date(2018, 12, 12), datetime.date(2018, 7, 28), 'C101', 'F101', datetime.date(2018, 7, 31), 'Approved', 2000, 10000, 'B1000'),
 ('E107', datetime.date(2018, 11, 23), datetime.date(2018, 7, 28), 'C105', 'F100', datetime.date(2018, 7, 31), 'Denied', 10000, 5000, None)]

In [3]:
%%sql

SELECT * FROM Employee;

 * postgresql://postgres:***@localhost:5432/dme_m03
4 rows affected.

[('E100', 'Chuck Coordinator', 'Administration', 'chuck@colorado.edu', '3-1111'),
 ('E101', 'Mary Manager', 'Football', 'mary@colorado.edu', '5-1111'),
 ('E102', 'Sally Supervisor', 'Planning', 'sally@colorado.edu', '3-2222'),
 ('E103', 'Alan Administrator', 'Administration', 'alan@colorado.edu', '3-3333')]